MyHome/src/Documents/РегистрацияФизическихУпражений/РегистрацияФизическихУпражений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияФизическихУпражений</name>
  <registerRecords>AccumulationRegister.СтатистикаФизическихУпражнений</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФизическиеУпражения</name>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.ФизическиеУпражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиФизическихУпражнений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/AccumulationRegisters/СтатистикаФизическихУпражнений/СтатистикаФизическихУпражнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтатистикаФизическихУпражнений</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиФизическихУпражнений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упражнение</name>
    <type>
      <types>CatalogRef.ФизическиеУпражнения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyHome/src/Documents/РегистрацияФизическихУпражений/ManagerModule.bsl
Функция ТаблицаДвиженийСтатистикаУпражнений(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Упражнения.Ссылка КАК Регистратор,
	|	РегистрацияФизическихУпражений.Дата КАК Период,
	|	Упражнения.Ссылка.Ответственный КАК Пользователь,
	|	Упражнения.Упражнение,
	|	Упражнения.Показатель,
	|	Упражнения.Количество
	|ИЗ
	|	Документ.РегистрацияФизическихУпражений.ФизическиеУпражения КАК Упражнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияФизическихУпражений КАК РегистрацияФизическихУпражений
	|		ПО Упражнения.Ссылка = РегистрацияФизическихУпражений.Ссылка
	|ГДЕ
	|	Упражнения.Ссылка = &Ссылка";
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Процедура ОтразитьДвиженияСтатистикаУпражненийЭкспорт(Ссылка, Движения, Отказ) Экспорт
	
	ТаблицаУпражнения = ТаблицаДвиженийСтатистикаУпражнений(Ссылка);
	
	Если Отказ ИЛИ ТаблицаУпражнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУпражнения = Движения.СтатистикаФизическихУпражнений;
	ДвиженияУпражнения.Записывать = Истина;
	ДвиженияУпражнения.Загрузить(ТаблицаУпражнения);
	
КонецПроцедуры
